#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

[command]/home/runner/work/_temp/97f6b647-740c-4e27-849f-bb0b47368a3c/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-rGfp9S8wDjbWgFVy

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_jaeger will be created
  + resource "github_repository" "quarkus_jaeger" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "An open source software for tracing transactions between distributed services"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + homepage_url                = "https://www.jaegertracing.io/"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-jaeger"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "jaeger",
          + "quarkus-extension",
          + "tracing",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

  # github_repository.quarkus_mailpit will be updated in-place
  ~ resource "github_repository" "quarkus_mailpit" {
      ~ description                 = "Dev Service for Quarkus Mailer" -> "An email and SMTP testing tool with API for developers"
        id                          = "quarkus-mailpit"
        name                        = "quarkus-mailpit"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_smallrye_opentracing will be created
  + resource "github_repository" "quarkus_smallrye_opentracing" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A MicroProfile-OpenTracing implementation"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + homepage_url                = "https://smallrye.io/"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-smallrye-opentracing"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "opentracing",
          + "quarkus-extension",
          + "smallrye",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

  # github_team.quarkus_jaeger will be created
  + resource "github_team" "quarkus_jaeger" {
      + create_default_maintainer = false
      + description               = "jaeger team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-jaeger"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.quarkus_smallrye_opentracing will be created
  + resource "github_team" "quarkus_smallrye_opentracing" {
      + create_default_maintainer = false
      + description               = "smallrye-opentracing team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-smallrye-opentracing"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_jaeger["brunobat"] will be created
  + resource "github_team_membership" "quarkus_jaeger" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "brunobat"
    }

  # github_team_membership.quarkus_jaeger["gsmet"] will be created
  + resource "github_team_membership" "quarkus_jaeger" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "gsmet"
    }

  # github_team_membership.quarkus_smallrye_opentracing["brunobat"] will be created
  + resource "github_team_membership" "quarkus_smallrye_opentracing" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "brunobat"
    }

  # github_team_membership.quarkus_smallrye_opentracing["gsmet"] will be created
  + resource "github_team_membership" "quarkus_smallrye_opentracing" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "gsmet"
    }

  # github_team_repository.quarkus_jaeger will be created
  + resource "github_team_repository" "quarkus_jaeger" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-jaeger"
      + team_id    = (known after apply)
    }

  # github_team_repository.quarkus_smallrye_opentracing will be created
  + resource "github_team_repository" "quarkus_smallrye_opentracing" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-smallrye-opentracing"
      + team_id    = (known after apply)
    }

Plan: 10 to add, 1 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0
```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*